src/Documents/РасходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>РасходнаяНакладная</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.ЗарезервированныеТовары</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПоДокументу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНоменклатуры</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ЗарезервированныеТовары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<AccumulationRegister>
		<Properties>
			<Name>ЗарезервированныеТовары</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/РасходнаяНакладная/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		Покупатель = ДанныеЗаполнения.Покупатель;
		ДокОснование = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаСписокНоменклатуры Из ДанныеЗаполнения.СписокНоменклатуры Цикл
			НоваяСтрока = СписокНоменклатуры.Добавить();
			НоваяСтрока.Количество = ТекСтрокаСписокНоменклатуры.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаСписокНоменклатуры.Номенклатура;
		КонецЦикла;
	Иначе
		Сообщить("Документ вводиться на основании заказа!");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)


Блокировка = Новый БлокировкаДанных;
ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиНоменклатуры");
ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
ЭлементБлокировки.ИсточникДанных = СписокНоменклатуры;
ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
Блокировка.Заблокировать();

Блокировка2 = Новый БлокировкаДанных;
ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ЗарезервированныеТовары");
ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
ЭлементБлокировки.ИсточникДанных = СписокНоменклатуры;
ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
Блокировка2.Заблокировать();



Движения.ОстаткиНоменклатуры.Записывать = Истина;
Движения.ОстаткиНоменклатуры.Очистить();
Движения.Записать();


Движения.ЗарезервированныеТовары.Записывать = Истина;
Движения.ЗарезервированныеТовары.Очистить();
Движения.Записать();

Движения.ОстаткиНоменклатуры.Записывать = Истина;
Движения.ЗарезервированныеТовары.Записывать = Истина;



Запрос = Новый("Запрос");
МВТ = Новый("МенеджерВременныхТаблиц");
Запрос.МенеджерВременныхТаблиц = МВТ;
Запрос.Текст ="ВЫБРАТЬ
              | РасходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
              | СУММА(РасходнаяНакладнаяСписокНоменклатуры.Количество) КАК Количество,
              | СУММА(РасходнаяНакладнаяСписокНоменклатуры.Сумма) КАК Сумма,
              | МАКСИМУМ(РасходнаяНакладнаяСписокНоменклатуры.НомерСтроки) КАК НомерСтроки
              |ПОМЕСТИТЬ ДокТЧ
              |ИЗ
              | Документ.РасходнаяНакладная.СписокНоменклатуры КАК РасходнаяНакладнаяСписокНоменклатуры
              |ГДЕ
              | РасходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
              |
              |СГРУППИРОВАТЬ ПО
              | РасходнаяНакладнаяСписокНоменклатуры.Номенклатура
              |
              |ИНДЕКСИРОВАТЬ ПО
              | Номенклатура
              |;
              |
              |////////////////////////////////////////////////////////////////////////////////
              |ВЫБРАТЬ
              | ОстаткиНоменклатурыОстатки.Номенклатура,
              | ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0) КАК ОстатокКол,
              | ЕСТЬNULL(ОстаткиНоменклатурыОстатки.СебестоимостьОстаток, 0) КАК ОстатокСум
              |ПОМЕСТИТЬ ОстаткиПоСкладу
              |ИЗ
              | РегистрНакопления.ОстаткиНоменклатуры.Остатки(
              |   &ТочкаИтогов,
              |   Номенклатура В
              |     (ВЫБРАТЬ РАЗЛИЧНЫЕ
              |      ДокТЧ.Номенклатура
              |     ИЗ
              |      ДокТЧ)
              |    И Склад = &Склад) КАК ОстаткиНоменклатурыОстатки
              |;
              |
              |////////////////////////////////////////////////////////////////////////////////
              |ВЫБРАТЬ
              | ОстаткиНоменклатурыОстатки.Номенклатура,
              | ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0) КАК ОстатокКол
              |ПОМЕСТИТЬ ОстаткиПоВсемСкладам
              |ИЗ
              | РегистрНакопления.ОстаткиНоменклатуры.Остатки(
              |   &ТочкаИтогов,
              |   Номенклатура В
              |    (ВЫБРАТЬ РАЗЛИЧНЫЕ
              |     ДокТЧ.Номенклатура
              |    ИЗ
              |     ДокТЧ)) КАК ОстаткиНоменклатурыОстатки
              |;
              |
              |////////////////////////////////////////////////////////////////////////////////
              |ВЫБРАТЬ
              | РезервОстатки.Номенклатура,
              | ЕСТЬNULL(РезервОстатки.КоличествоОстаток, 0) КАК Остаток,
              | ЕСТЬNULL(РезервОстатки.РезервОстаток, 0) КАК Резерв
              |ПОМЕСТИТЬ РезервПоЗаказу
              |ИЗ
              | РегистрНакопления.ЗарезервированныеТовары.Остатки(
              |   &ТочкаИтогов,
              |   Заказ = &Заказ
              |    И Номенклатура В
              |     (ВЫБРАТЬ РАЗЛИЧНЫЕ
              |      ДокТЧ.Номенклатура
              |     ИЗ
              |      ДокТЧ)) КАК РезервОстатки
              |;
              |
              |////////////////////////////////////////////////////////////////////////////////
              |ВЫБРАТЬ
              | РезервОстатки.Номенклатура,
              | ЕСТЬNULL(РезервОстатки.КоличествоОстаток, 0) КАК КолОст,
              | ЕСТЬNULL(РезервОстатки.РезервОстаток, 0) КАК КолРез
              |ПОМЕСТИТЬ РезервПоДругимЗаказам
              |ИЗ
              | РегистрНакопления.ЗарезервированныеТовары.Остатки(
              |   &ТочкаИтогов,
              |   Заказ <> &Заказ
              |    И Номенклатура В
              |     (ВЫБРАТЬ РАЗЛИЧНЫЕ
              |      ДокТЧ.Номенклатура
              |     ИЗ
              |      ДокТЧ)) КАК РезервОстатки
              |;
              |
              |////////////////////////////////////////////////////////////////////////////////
              |ВЫБРАТЬ
              | ДокТЧ.Номенклатура,
              | ДокТЧ.Количество,
              | РезервПоЗаказу.остаток КАК ОстатокТекЗаказа,
              | РезервПоЗаказу.Резерв КАК РезервТекЗаказа,
              | РезервПоДругимЗаказам.КолОст КАК ОстатокДрЗаказов,
              | РезервПоДругимЗаказам.КолРез КАК РезервДрЗаказов,
              | ЕСТЬNULL(ОстаткиПоСкладу.ОстатокКол, 0) КАК ОстатокНаСкладеКол,
              | ЕСТЬNULL(ОстаткиПоСкладу.ОстатокСум, 0) КАК ОстатокНаСкладеСум,
              | ОстаткиПоВсемСкладам.ОстатокКол КАК ОбщийОстаток,
              | ЕСТЬNULL(ОстаткиПоВсемСкладам.ОстатокКол, 0) - ЕСТЬNULL(РезервПоДругимЗаказам.КолРез, 0) КАК СвободныйОстаток
              |ИЗ
              | ДокТЧ КАК ДокТЧ
              |  ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиПоСкладу КАК ОстаткиПоСкладу
              |  ПО ДокТЧ.Номенклатура = ОстаткиПоСкладу.Номенклатура
              |  ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиПоВсемСкладам КАК ОстаткиПоВсемСкладам
              |  ПО ДокТЧ.Номенклатура = ОстаткиПоВсемСкладам.Номенклатура
              |  ЛЕВОЕ СОЕДИНЕНИЕ РезервПоЗаказу КАК РезервПоЗаказу
              |  ПО ДокТЧ.Номенклатура = РезервПоЗаказу.Номенклатура
              |  ЛЕВОЕ СОЕДИНЕНИЕ РезервПоДругимЗаказам КАК РезервПоДругимЗаказам
              |  ПО ДокТЧ.Номенклатура = РезервПоДругимЗаказам.Номенклатура";

Запрос.УстановитьПараметр("Ссылка", Ссылка);
Запрос.УстановитьПараметр("ТочкаИтогов", Новый Граница(МоментВремени(),ВидГраницы.Исключая));
Запрос.УстановитьПараметр("Склад", Склад);
Запрос.УстановитьПараметр("Заказ", ДокОснование );

Выборка = Запрос.Выполнить().Выбрать();
Пока Выборка.Следующий() Цикл

	Если Выборка.Количество> Выборка.СвободныйОстаток Тогда
	Сообщить("Для Номенклатуры " + Выборка.номенклатура +" требуемое количество " + Выборка.Количество+"превышает свободный остаток "+ Выборка.СвободныйОстаток);
	Отказ = Истина;
	ИначеЕсли Выборка.Количество > Выборка.ОстатокНаСкладеКол Тогда
	Сообщить("Для Номенклатуры " + Выборка.номенклатура +" требуемое количество " + Выборка.Количество+"превышает  остаток на складе "+ Выборка.ОстатокНаСкладеКол);
	Отказ = Истина;


КонецЕсли;
КонецЦикла;

Если Выборка.ОстатокНаСкладеКол = 0 Тогда
	
	Себест = Выборка.ОстатокНаСкладеСум;
Иначе
	Себест = Выборка.Количество / Выборка.ОстатокНаСкладеКол * Выборка.ОстатокНаСкладеСум;

КонецЕсли;

Движение = Движения.ОстаткиНоменклатуры.ДобавитьРасход();
Движение.Период = Дата;
Движение.Номенклатура = Выборка.Номенклатура;
Движение.Склад = Склад;
Движение.Количество = Выборка.Количество;
Движение.Себестоимость = Себест;

Движение = Движения.ЗарезервированныеТовары.ДобавитьРасход();
Движение.Период = Дата;
Движение.Заказ = ДокОснование;
Движение.Номенклатура = Выборка.Номенклатура;
Движение.Количество = Выборка.Количество;


КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = 0;
	Для Каждого СтрокаТЧ ИЗ СписокНоменклатуры Цикл
		СуммаПоДокументу = СтрокаТЧ.Сумма;
	КонецЦикла;
КонецПроцедуры
